Revit 2024 API
Dimension.DimensionType Property
 The dimension style of this dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public DimensionType DimensionType { get; set; }
Visual Basic
Public Property DimensionType As DimensionType
	Get
	Set
Visual C++
public:
property DimensionType^ DimensionType {
	DimensionType^ get ();
	void set (DimensionType^ value);
}
See Also
Dimension Class
Autodesk.Revit.DB Namespace